# ProjectLocations Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Document..::..ProjectLocations Property
Document Class See Also
---
Retrieve all the project locations associated with this project
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ProjectLocationSet ProjectLocations { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ProjectLocations As ProjectLocationSet
	Get
```

Visual C++
---
```text
public:
property ProjectLocationSet^ ProjectLocations {
	ProjectLocationSet^ get ();
}
```

# Remarks
This property returns all the locations of the project. A project can have one site location but many project locations within that site. Each project location object is an offset and rotation from the site location.
# See Also
Document Class
Autodesk.Revit.DB Namespace